Revit 2024 API
ViewOrientation3D Properties
The ViewOrientation3D type exposes the following members.
Properties
Name | Description
EyePosition
 The eye position point
ForwardDirection
 The forward direction vector
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UpDirection
 The up direction vector
See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace